<?php
class Transliteration extends CWidget
{

    protected static $arraySymbols = array();

    public static function _set()
    {
        self::$arraySymbols = array(
            "А"=>"a","Б"=>"b","В"=>"v","Г"=>"g",
            "Д"=>"d","Е"=>"e","Ё"=>"e","Ж"=>"j",
            "З"=>"z","И"=>"i","Й"=>"y","К"=>"k",
            "Л"=>"l","М"=>"m","Н"=>"n","О"=>"o",
            "П"=>"p","Р"=>"r","С"=>"s","Т"=>"t",
            "У"=>"u","Ф"=>"f","Х"=>"h","Ц"=>"ts",
            "Ч"=>"ch","Ш"=>"sh","Щ"=>"sch","Ъ"=>"",
            "Ы"=>"i","Ь"=>"","Э"=>"e","Ю"=>"yu",
            "Я"=>"ya","а"=>"a","б"=>"b","в"=>"v",
            "г"=>"g","д"=>"d","е"=>"e","ё"=>"e",
            "ж"=>"j","з"=>"z","и"=>"i","й"=>"y",
            "к"=>"k","л"=>"l","м"=>"m","н"=>"n",
            "о"=>"o","п"=>"p","р"=>"r","с"=>"s",
            "т"=>"t","у"=>"u","ф"=>"f","х"=>"h",
            "ц"=>"ts","ч"=>"ch","ш"=>"sh","щ"=>"sch",
            "ъ"=>"y","ы"=>"i","ь"=>"","э"=>"e",
            "ю"=>"yu","я"=>"ya",

            "   "=> "-","  "=> "-"," "=> "-","."=> "","/"=> "-",","=>"-",
            "_"=>"-","("=>"",")"=>"","["=>"",
            "]"=>"","="=>"-","+"=>"plus","*"=>"",
            "?"=>"","\""=>"","'"=>"","&"=>"",
            "%"=>"","#"=>"","@"=>"","!"=>"",
            ";"=>"","№"=>"","^"=>"",":"=>"",
            "~"=>"","\\"=>""
        );
    }

    public static function convertToUrl($str)
    {
        self::_set();
        $text = strtr($str, self::$arraySymbols);

        $text = preg_replace('/[^A-Za-z0-9_\-]/', '', $text);
        return trim(strtolower($text));

//        $str = trim($str, '-,"');
//        return mb_strtolower($str);
    }
}
?>